app/Http/Livewire/Pages/Dashboards/Wallet/Transfer/Table.php

    public function searchClient(): void
    {
        $this->validate();
        $this->client = User::where('email', $this->searchPhrase)
            ->firstOrFail()->toArray();
---
select * from `users` where `email` = 'juniorbraga222@gmail.com' limit 1

    public function transferBalance(): void
    {

        $myOldBalance = $this->user->balance;
        $oldBalanceClient = $this->client['balance'];
        $this->client['balance'] += (float) Money::toDatabase($this->valueTransfer);
        $this->user->balance -= (float) Money::toDatabase($this->valueTransfer);

        $client = User::find($this->client['id']);
        $client->balance = $this->client['balance'];

        $client->save();
---
select * from `users` where `users`.`id` = 231 limit 1
update `users` set `balance` = 999, `users`.`updated_at` = '2022-01-28 22:38:03' where `id` = 1

    private function storeTransact(User $user, string $value, string $oldValue, string $type): void
    {
        TransactBalance::create([
            'user_id_sender' => $this->userId,
            'user_id' => $user->id,
            'value' => Money::toDatabase($value),
            'old_value' => $oldValue,
            'type' => $type
        ]);
---
insert into `transact_balance` (`user_id_sender`, `user_id`, `value`, `old_value`, `type`, `updated_at`, `created_at`) values (1, 1, '1.00', '1000', 'Saldo transferido para Kelver', '2022-01-28 22:38:03', '2022-01-28 22:38:03')

    private function storeContact(User $user): void
    {
        $verifyContact = ClientContact::where([
                'user_id' => $this->userId,
                'user_id_contact' => $user->id
            ])
            ->exists();

        if(!$verifyContact) {
            ClientContact::create([
                'user_id' => $this->userId,
                'user_id_contact' => $user->id
            ]);
---
select exists(select * from `client_contacts` where (`user_id` = 1 and `user_id_contact` = 231)) as `exists`
insert into `client_contacts` (`user_id`, `user_id_contact`, `updated_at`, `created_at`) values (1, 231, '2022-01-28 22:38:03', '2022-01-28 22:38:03')