app/Http/Controllers/Admin/Pages/Settings/UserController.php

select * from `roles` order by `name` asc
---
    public function create()
    {
        if(!auth()->user()->hasPermissionTo('create_user')){
            abort(403);
        }

        $roles = Role::orderBy('name')->get();

insert into `users` (`name`, `last_name`, `email`, `password`, `commission`, `indicador`, `type_client`, `balance`, `updated_at`, `created_at`) values ('kelver', 'teste2', 'kelver_kmv@teste.com.br', '$2y$10$1hxGAh.xjJWegWjNYvtWMe0f00SeEKHuw3P9251uxkGQ023aXmAMy', '10', 1, 1, 110, '2021-11-17 23:12:42', '2021-11-17 23:12:42')
---
                $user->type_client = 1;
            }
            $user->balance = $balanceRequest;
            $user->save();

select * from `roles` order by `name` asc
---
    public function edit(User $user)
    {
        if(!auth()->user()->hasPermissionTo('update_user')){
            abort(403);
        }

        $roles = Role::orderBy('name')->get();