app/Http/Livewire/Pages/Dashboards/Wallet/Recharge/Orders.php

select * from `recharge_order` order by `id` desc limit 10 offset 30
select * from `users` where `users`.`id` in ('')
select count(*) as aggregate from `recharge_order`
select * from `recharge_order` where `user_id` = 1 order by `id` desc limit 10 offset 0
select * from `users` where `users`.`id` in (1)
---
    public function render()
    {
        $orders = collect([]);
        $typeStatus = [
            'Pendente', 'Aprovado', 'Cancelado', 'Falha'
        ];
        $allOrders = RechargeOrder::with('user')
            ->orderByDesc('id')
            ->paginate(10);


        $allOrders->each(function($item, $key) use ($allOrders, $orders, $typeStatus) {

            if($orders->contains('reference', $item->reference)) {
                $allOrders->forget($key);
            }

            if(!$orders->contains('reference', $item->reference)) {
                $item->data = Carbon::parse($item->created_at)->format('d/m/y à\\s H:i');
                $item->value = Money::toReal($item->value);
                $item->statusTxt = $typeStatus[$item->status];

                $orders->push($item);
            }
        });