app/Http/Livewire/Pages/Dashboards/Wallet/Recharge/OrderDetail.php

    public function render()
    {
        $order = RechargeOrder::where('reference', request('id'))->first();
---
select * from `recharge_order` where `reference` = 'c7ab9068-133e-4082-8b70-812591909cb8'