app/Http/Livewire/Pages/Dashboards/Wallet/Recharge/Table.php

insert into `recharge_order` (`user_id`, `value`, `status`, `reference`, `updated_at`, `created_at`) values (231, 1, 0, '\"9e5eac84-00e4-4cdd-9c9b-09356c6f22d1\"', '2022-01-28 22:46:02', '2022-01-28 22:46:02')
---
    public function callMP()
    {
        SDK::setAccessToken("APP_USR-2909617305972251-012203-1eb52e7fbfc50a7355b5beb6d5abbe79-1011031176"); // Either Production or SandBox AccessToken

        $preference = new Preference();
        $item = new Item();

        $item->title = "Recarga SuperLotogiro";
        $item->quantity = 1;
        $item->unit_price = (double) $this->valueAdd;

        $order = new RechargeOrder([
            'user_id' => auth()->id(),
            'value' => (double) $this->valueAdd,
            'status' => 0
        ]);
        $order->save();