app/Http/Livewire/Pages/Dashboards/Wallet/Extract/Table.php

    public function mount()
    {
        $transacts = TransactBalance::with('user', 'userSender')
            ->where('user_id', auth()->id())
            ->paginate(10);

        $this->paginate['next'] = $transacts->nextPageUrl();
        $this->paginate['prev'] = $transacts->previousPageUrl();
---
select * from `transact_balance` where `user_id` = 231 limit 10 offset 30
select * from `users` where `users`.`id` in (231)
select count(*) as aggregate from `transact_balance` where `user_id` = 231
select * from `transact_balance` where `user_id` = 1 limit 10 offset 0
select * from `users` where `users`.`id` in (1)
select count(*) as aggregate from `transact_balance` where `user_id` = 1
select * from `transact_balance` limit 10 offset 0
select * from `users` where `users`.`id` in (1, 200, 231)
select count(*) as aggregate from `transact_balance`