app/Http/Livewire/Pages/Bets/Game/Copiacola.php

select * from `type_game_values` where (`type_game_id` = 1 and `numbers` = 17)
---
    public function dezenas(){
        $this->reset('msg');
        $this->reset('values');
        $this->dezena = explode("\n", $this->dezena);
        $tmp = array_filter($this->dezena);
        $str = implode("\n", $tmp);
        $this->dezena = explode("\n", $str);
        $typeGameValue;
        $result;
        $contadorLinhas;
        $contador = 0;
        foreach($this->dezena as $dezenaConvert){
            $this->contadorJogos++;
            $string = preg_replace('/^\h*\v+/m', '', $dezenaConvert);
            //$string = preg_replace('/\s+/', ' ', trim($dezenaConvert));
            $words = explode(" ", $string);
            $result =  count($words);
            if($contador == 0){
                 $contadorLinhas = $result;
            }
            if($result > $contadorLinhas){
                $this->msg = "Existem linhas de dezenas diferentes";
                break 1;
            }
            $contador = 1;
            $contadorLinhas = $result;

        }
        if($this->msg == null){
        $typeGameValue = TypeGameValue::where([
            ['type_game_id', $this->typeGame->id],
            ['numbers', $result],
        ])->get();

select * from `clients` where `name` like '%g%'
---
        public function updatedSearch($value)
    {

            $this->clients = Client::where("name", "like", "%{$this->search}%")->get();