app/Http/Livewire/Pages/Bets/Game/Form.php

select * from `type_game_values` where (`type_game_id` = 1 and `numbers` = 17)
---
    public function verifyValue()
    {
        $numbers = count($this->selectedNumbers);

        $typeGameValue = TypeGameValue::where([
            ['type_game_id', $this->typeGame->id],
            ['numbers', $numbers],
        ])->get();

select `numbers` from `type_game_values` where `type_game_id` = 1 order by `numbers` asc
---
    public function render()
    {
        $User = Auth::user();
        $FiltroUser = client::where('email', $User['email'])->first();
        $this->FiltroUser = $FiltroUser;

        $busca = TypeGameValue::select('numbers')->where('type_game_id', $this->typeGame->id)->orderBy('numbers', 'asc')->get();