app/Http/Livewire/Pages/Dashboards/Wallet/Withdraw/AdminList.php

select * from `users` where `users`.`id` in (1, 231)
select * from `withdraw_request` limit 10 offset 0
select count(*) as aggregate from `withdraw_request`
---
    public function render()
    {
        $withdraws = WithdrawRequest::with('user')
            ->paginate(10);
        $withdraws->each(function($item, $key){
            $item->data = Carbon::parse($item->created_at)->format('d/m/y à\\s H:i');
            $item->responsavel = $item->user->name;
            $item->data = Money::toReal($item->value);
            $item->statusTxt = $item->status === 0 ? 'À fazer' : 'Feito';
        });