app/Http/Livewire/Pages/Dashboards/Wallet/Withdraw/Table.php

    public function mount(): void
    {
        $this->user = User::with('client')->find(auth()->id())->toArray();
---
select * from `clients` where `clients`.`id` in ('')
select * from `users` where `users`.`id` = 231 limit 1