app/Http/Controllers/Admin/Pages/Bets/DrawController.php

    public function index(Request $request)
    {
        if(!auth()->user()->hasPermissionTo('read_draw')){
            abort(403);
        }

        if ($request->ajax()) {
            $draw = $this->draw->get();
---
select * from `draws`