app/Http/Controllers/Admin/Pages/Bets/GameController.php

select * from `games` where type_game_id = '1' and checked = 1
select * from `users` where `users`.`id` = 1 limit 1
---
    public function index(Request $request, $typeGame)
    {
        if (!auth()->user()->hasPermissionTo('read_game')) {
            abort(403);
        }
        if ($request->ajax()) {
            $game = $this->game->whereRaw('type_game_id = ? and checked = 1', $typeGame);
            if (!auth()->user()->hasPermissionTo('read_all_games')) $game->where('user_id', auth()->id());
            $game->get();

select * from `type_games`
select * from `clients`
---
    public function carregarJogo(TypeGame $typeGame){
          $typeGames = TypeGame::get();
          $clients = Client::get();

select * from `type_games` where `type_games`.`id` in (1, 'BR - Lotofácil 15', 25, 5, '#CA22BA', 'lf', 'Lotofácil marque de 17 até 23 dezenas , acerte as 15 sorteadas e fature o premio de acordo com o valor da sua aposta!', '2021-02-10T00:34:45.000000Z', '2022-01-01T23:54:53.000000Z')
---
    public function create(TypeGame $typeGame)
    {
        if (!auth()->user()->hasPermissionTo('create_game')) {
            abort(403);
        }

        $typeGames = TypeGame::find($typeGame)->first();