app/Http/Controllers/Admin/Pages/Bets/ValidateGamesController.php

select * from `bets` where (`user_id` = 1 and `status` = 0)
---
    public function index(Request $request)
    {
        if ($request->ajax()) {
            $bet = $this->bet->where([
                ['user_id', auth()->id()],
                ['status', false]
            ])->get();